export default [
  {
    id    : `10`,
    order : 100,
    label : `Директор`
  }, {
    id    : `20`,
    order : 200,
    label : `Руководитель производственного отделения`
  }, {
    id    : `30`,
    order : 300,
    label : `Инженер`
  }, {
    id    : `40`,
    order : 400,
    label : `Специалист технической поддержки`
  }, {
    id    : `50`,
    order : 500,
    label : `Технический директор`
  }, {
    id    : `60`,
    order : 600,
    label : `Менеджер`
  }, {
    id    : `70`,
    order : 700,
    label : `Ответственный за статистики`
  }
];
