import { BxMenuItem, BxMenuItemEnts } from "../../../../../types";

export const BX_HOOKS_LIST_ENT: BxMenuItemEnts = {
  id200: {
    id          : `200`,
    label       : `Загрузить новых абонентов в Битрикс24`,
    active      : true,
    instruction : `
      1 - Загрузите файл с данными новых (обновлённых) абонентов из BG биллинга.
      2 - Проверьте созданные сущности.
      3 - При необходимости внесите правки вручную
      4 - Нажмите "Загрузить"
    `,
    toolTitle   : `
      1 - На основе загруженного Пользователем файла с данными новых или обновлённых абонентов из BG биллинга, будут созданы Компании и Контакты для загрузки в Битрикс.
      2 - Пользователю нужно подтвердить правильность созданных данных и скорректировать их или отправить в Битрикс
    `
  },
  id400: {
    id          : `400`,
    label       : `Обновить существующих абонентов в Битрикс24`,
    active      : false,
    instruction : `
      1 - Загрузите файл с данными обновлённых абонентов из BG биллинга.
      2 - Проверьте созданные сущности.
      3 - При необходимости внесите правки вручную
      4 - Нажмите "Загрузить в BX"
    `,
    toolTitle   : `
      1 - На основе загруженного Пользователем файла с данными по обновлённым абонентам из BG биллинга, будут обновлены Компании и Контакты для загрузки в Битрикс.
      2 - Пользователю нужно подтвердить правильность созданных данных и скорректировать их или отправить в Битрикс
    `
  }
};

export const BX_HOOKS_LIST_ITEMS: BxMenuItem[] = Object.values(BX_HOOKS_LIST_ENT);
