// Названия заголовков по которым будут искаться данные
export default {
  CssDB: { // ДТ - Инциденты
    dateReg    : `Дата регистрации`,
    dateEnd    : `Дата завершения`,
    personReg  : `Инцидент принял`,
    personEnd  : `Cотрудник решающий/решивший запрос`,
    status     : `Текущий статус`,
    ballsTD    : `Баллы ТД`,
    balls      : `Баллы Техподд`,
  },
  CssInstDB: { // ДТ - Инсталляции
    dateReg    : `Дата регистрации`,
    dateEnd    : `Дата завершения`,
    typeClient : `Тип абонента`,
    typeInstall: `Тип инсталляции`,
    range      : `Диапазон`,
    personReg  : `Инцидент принял`,
    personEnd  : `Cотрудник сопровождающий инсталляцию`,
    status     : `Текущий статус`,
    balls      : `Баллы`, 
  }, 
  CssExpDB: { // ДТ - Опытное пр-во
    dateEnd    : `Дата завершения`,
    personEnd  : `Cотрудник решающий/решивший запрос`,
    status     : `Текущий статус`,
    balls      : `Баллы`,
  },  
  BadcomDB: { // Badcom
    dateReg    : `Дата регистрации`,
    dateEnd    : `Дата завершения`,
    personReg  : `Инцидент принял`,
    personEnd  : `Cотрудник решающий/решивший запрос`,
    status     : `Текущий статус`,
    ballsTD    : `Баллы ТД`,
    balls      : `Баллы Техподд`,
  }, 
};
