export default {
  auth: {
    accountDisabled          : `Данный аккаунт отключен. Обратитесь в службу технической поддержки.`,
    unauthorizedRequest      : `Неавторизованный запрос!`,
    unknownUserEmail         : `Пользователь с таким email не найден`,
    cookieNotAuth            : `Пользователь не авторизован`,

    emailExist               : `Этот email уже занят`,
    emailEmpty               : `Поле "Email" не должно быть пустым`,
    emailNotEmail            : `Введён не корректный email`,
    emailMoreMaxLength       : `Email не должен превышать 30 символов`,

    firstNameIsNotBeEmpty    : `Поле "Имя" должно быть заполнено`,
    firstNameMoreMaxLength   : `Имя не должно превышать 30 символов`,

    secondNameIsNotBeEmpty   : `Поле "Фамилия" должно быть заполнено`,
    secondNameMoreMaxLength  : `Фамилия не должна превышать 30 символов`,
    
    middleNameIsNotBeEmpty   : `Поле "Отчество" должно быть заполнено`,
    middleNameMoreMaxLength  : `Отчество не должна превышать 30 символов`,

    
    invalidMobileNumber      : `Не корректный номер мобильного телефона`,
  
    passwordEmpty            : `Поле "Пароль" не должно быть пустым`,
    passwordLessMaxLength    : `Пароль должен содержать более 6 символов`,
    passwordNotConfirm       : `Значение в поле "Подтверждение пароля", не совпадает с введёным паролем`,
    passwordWrong            : `Не верный пароль, попробуйте ещё раз`,
    notPermissions           : `Для регистрации, заполните необходимые поля и предоставьте согласие на обработку персональных данных`,

    idIsNotBeEmpty           : `Поле Id не должно быть пустым. Это ошибка разработчика`,
    companyNotFound          : `Компания не найдена, обновите справочник с компаниями и попробуйте ещё раз.`,
    companyIsNotBeEmpty      : `Название компании не должно быть пустым`,
    companyNameMoreMaxLength : `Название компании не должно превышать 100 символов`,
    invalidITN               : `ИНН должно состоять из 10 или 12 цифр`,
    invalidITNNoEmpty        : `Оставьте поле пустым или ИНН должно состоять из 10 или 12 цифр`,
    dublicateITN             : `Компания с таким ИНН уже есть в Справочнике`,
    invalidDescription       : `Примечание не должно превышать 300 символов`,
    companyTypeIsNotBeEmpty  : `Укажите тип компании`,
  
    cityIsNotBeEmpty         : `Поле "Город" должно быть заполнено`,
    cityMoreMaxLength        : `Поле "Город" не должно превышать 100 символов`,
    addressIsNotBeEmpty      : `Поле "Адрес" должно быть заполнено`,
    addressMoreMaxLength     : `Поле "Адрес" не должно превышать 100 символов`,
    regionIsNotBeEmpty       : `Поле "Регион" должно быть заполнено`,
    addressNotFound          : `Адрес не найден, обновите справочник с адресами и попробуйте ещё раз.`,
  
    nameMoreMaxLength        : `Поля для ФИО не должны превышать 30 символов`,
    positionMoreMaxLength    : `Поля "Должность" не должно превышать 30 символов`,
    contactNotFound          : `Контакт не найден, обновите справочник с контактами и попробуйте ещё раз.`,
  
    roleTypesIsNoOneOfSeveral: `Не допустимый "Тип роли". Должна быть одной из предложенных.`,
    roleIsNotBeEmpty         : `Поле "Роль" должно быть заполнено`,
    roleMoreMaxLength        : `Поле "Роль" не должно превышать 30 символов`,
    descriptionMoreMaxLength : `Поле "Примечание" не должно превышать 100 символов`,
    roleNotFound             : `Роль не найдена, обновите справочник с ролями и попробуйте ещё раз.`,
  
    driverNotFound           : `Водитель не найден, обновите справочник с водителями и попробуйте ещё раз.`,
 
    labelIsNotBeEmpty        : `Поле должно быть заполнено`,
    cargoNotFound            : `Груз не найден, обновите справочник с грузом и попробуйте ещё раз.`,
  
    roleIdIsNotBeEmpty       : `Поле "Роль" должно быть заполнено`,
    roleTypeIsNoOneOfSeveral : `Не допустимый "Тип пользователя". Должен быть одним из предложенных.`,
    userNotFound             : `Пользователь не найден, обновите справочник с пользователями и попробуйте ещё раз.`,
  },

  statictics: {
    dateIsNotBeEmpty     : `Выберите корректную дату.`,
    dateFromNotBeGreater : `Начальная дата, не должна быть больше конечной`
  },

  helpers: {
    invalidType : `Выбран не поддерживаемый тип для запроса`,
  },
  general: `Что-то пошло не так. Мы уже отправили разработчику отчёт об этом... Вскоре, всё починят......`

}